04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/drivaerFastback/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          16;

wheelRadius     0.318;
wheelBase       2.786;
wheelSpeed      #calc "$Uinlet / $wheelRadius";


dimensions      [velocity];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ($Uinlet 0 0);
    }

    ground { $inlet; }

    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform ($Uinlet 0 0);
    }

    wall
    {
        type            noSlip;
    }

    frontWheels
    {
        type            rotatingWallVelocity;
        origin          (0 0 $wheelRadius);
        axis            (0 -1 0);
        omega           $wheelSpeed;
    }

    rearWheels
    {
        $frontWheels;
        origin          ($wheelBase 0 $wheelRadius);
    }

    processor
    {
        type            processor;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
